const date = ["پھرين","ٻہ", "ٽي", "چار", "پنج", "ڇھ", "ست", "اٺ", "نَو", "ڏھ", "يارھن", "ٻارھن", "تيرھن", "چوڏھن", "پنڌرھن", "سورھن", "سترھن", "ارڙھن", "اوڻيھ", "ويھ", "ايڪيھ", "ٻاويھ", "ٽيويھ", "چوويھ", "پجويھ", "ڇويھ", "ستاويھ", "اٺاويھ", "اڻٽييھ", "ٽيھ", "ايڪٽيھ"];
const month = ["جنوري", "فيبروري", "مارچ", "اپريل", "مئي", "جون", "جولاءِ", "آگسٽ", "سيپٽمبر", "آڪٽوبر", "نومبر", "ڊسمبر"];
const year = ["ٻہ ھزار ھڪ", "ٻہ ھزار ٻہ", "ٻہ ھزار ٽي", "ٻہ ھزار چار", "ٻہ ھزار پنج", "ٻہ ھزار ڇھ", "ٻہ ھزار ست", "ٻہ ھزار اٺ", "ٻہ ھزار نَو", "ٻہ ھزار ڏھ", "ٻہ ھزار يارھن", "ٻہ ھزار ٻارھن", "ٻہ ھزار تيرھن", "ٻہ ھزار چوڏھن", "ٻہ ھزار پنڌرھن", "ٻہ ھزار سورھن", "ٻہ ھزار سترھن", "ٻہ ھزار ارڙھن", "ٻہ ھزار اوڻيھ", "ٻہ ھزار ويھ", "ٻہ ھزار ايڪيھ", "ٻہ ھزار ٻاويھ", "ٻہ ھزار ٽيويھ", "ٻہ ھزار چوويھ", "ٻہ ھزار پجويھ", "ٻہ ھزار ڇويھ", "ٻہ ھزار ستاويھ", "ٻہ ھزار اٺاويھ", "ٻہ ھزار اڻٽيھ", "ٻہ ھزار ٽيھ"];

function convertToSindhiDate(dateString: string): string {
    const [yearIndex, monthIndex, day] = dateString.split('-').map(Number);
    const sindhiDay = date[day - 1];
    const sindhiMonth = month[monthIndex - 1];
    const sindhiYear = year[yearIndex - 2001];
    return `${sindhiDay} ${sindhiMonth} ${sindhiYear}`;
}

export { convertToSindhiDate };